martin-ger/esp32_PPPoE_router/components/cmd_router/cmd_router.c
/* The CLI commands of the router

   Unless required by applicable law or agreed to in writing, this
   software is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
   CONDITIONS OF ANY KIND, either express or implied.
*/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <time.h>
#include <inttypes.h>
#include <stdint.h>
#include "esp_log.h"
#include "esp_console.h"
#include "esp_system.h"
#include "esp_sleep.h"
#include "spi_flash_mmap.h"
#include "driver/rtc_io.h"
#include "driver/uart.h"
#include "argtable3/argtable3.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "sdkconfig.h"
#include "nvs.h"
#include "esp_wifi.h"

#include "lwip/ip4_addr.h"
#include "lwip/netif.h"
#include "esp_netif.h"
#include "esp_netif_net_stack.h"
#if !IP_NAPT
#error "IP_NAPT must be defined"
#endif
#include "lwip/lwip_napt.h"

#include "mbedtls/sha256.h"
#include "esp_random.h"

#include "driver/gpio.h"
#include "soc/soc_caps.h"
#if SOC_TEMP_SENSOR_SUPPORTED
#include "driver/temperature_sensor.h"
#endif
#include "router_globals.h"
#include "cmd_router.h"
#if CONFIG_ETH_UPLINK && defined(CONFIG_ETH_DRIVER_W5500)
#include "w5500_spi_driver.h"
#endif
#include "pcap_capture.h"
#include "acl.h"
#include "remote_console.h"
#include "syslog_client.h"
#include "esp_ota_ops.h"
#include "esp_app_desc.h"

#ifdef CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS
#define WITH_TASKS_INFO 1
#endif

static const char *TAG = "cmd_router";

static void register_set_hostname(void);
#if !CONFIG_ETH_UPLINK
static void register_set_sta(void);
static void register_set_mac(void);
#else
static void register_set_ap_mac_only(void);
#endif
static void register_set_sta_static(void);
static void register_set_ap(void);
static void register_set_ap_ip(void);
static void register_set_ap_hidden(void);
static void register_set_ap_auth(void);
static void register_ap(void);
#if CONFIG_ETH_UPLINK
static void register_set_ap_channel(void);
#endif
static void register_set_ap_dns(void);
static void register_show(void);
static void register_portmap(void);
static void register_dhcp_reserve(void);
static void register_set_router_password(void);
static void register_web_ui(void);
static void register_bytes(void);
#if CONFIG_PCAP_CAPTURE
static void register_pcap(void);
#endif
static void register_set_led_gpio(void);
static void register_set_led_lowactive(void);
static void register_set_ttl(void);
static void register_client_stats_cmd(void);
static void register_set_ap_nat(void);
static void register_set_tx_power(void);
static void register_set_wifi_country(void);
#if defined(CONFIG_IDF_TARGET_ESP32C6)
static void register_set_rf_switch(void);
#endif
static void register_acl(void);
static void register_remote_console_cmd(void);
static void register_syslog_cmd(void);
#if !CONFIG_ETH_UPLINK
static void register_scan(void);
#endif
#if WIFI_HAS_5GHZ
static void register_set_sta_band(void);
#endif
static void register_set_pppoe(void);
static void register_set_vpn(void);
static void register_set_tz(void);
#if CONFIG_DDNS_ENABLED
static void register_ddns_cmd(void);
#endif
#if CONFIG_ETH_UPLINK && defined(CONFIG_ETH_DRIVER_W5500)
static void register_w5500(void);
static void register_set_spi_clock(void);
#endif

/* ACL helper functions (forward declarations) */
static char* acl_format_ip_with_name(uint32_t ip, uint32_t mask, char* buf, size_t buf_len);
static bool acl_parse_ip_or_name(const char* str, uint32_t* ip, uint32_t* mask);
static void acl_print_with_names(uint8_t acl_no);

/* Check if character is a valid hex digit */
static inline int is_hex_digit(char c)
{
    return (c >= '0' && c <= '9') ||
           (c >= 'A' && c <= 'F') ||
           (c >= 'a' && c <= 'f');
}

/* Convert hex digit to value (assumes valid hex digit) */
static inline uint8_t hex_digit_value(char c)
{
    if (c >= '0' && c <= '9')
        return c - '0';
    else
        return toupper((unsigned char)c) - 'A' + 10;
}

/* Check if string represents a boolean true value */
static inline bool parse_bool_true(const char *str)
{
    return (strcasecmp(str, "true") == 0 ||
            strcasecmp(str, "yes") == 0 ||
            strcasecmp(str, "on") == 0 ||
            strcmp(str, "1") == 0);
}

/* Check if string represents a boolean false value */
static inline bool parse_bool_false(const char *str)
{
    return (strcasecmp(str, "false") == 0 ||
            strcasecmp(str, "no") == 0 ||
            strcasecmp(str, "off") == 0 ||
            strcmp(str, "0") == 0);
}

void preprocess_string(char* str)
{
    char *p, *q;

    for (p = q = str; *p != 0; p++)
    {
        if (*(p) == '%' && *(p + 1) != 0 && *(p + 2) != 0 &&
            is_hex_digit(*(p + 1)) && is_hex_digit(*(p + 2)))
        {
            // Valid percent-encoded hex sequence
            p++;
            uint8_t a = hex_digit_value(*p) << 4;
            p++;
            a += hex_digit_value(*p);
            *q++ = a;
        }
        else if (*(p) == '+') {
            *q++ = ' ';
        } else {
            *q++ = *p;
        }
    }
    *q = '\0';
}

esp_err_t get_config_param_str(char* name, char** param)
{
    nvs_handle_t nvs;

    esp_err_t err = nvs_open(PARAM_NAMESPACE, NVS_READONLY, &nvs);
    if (err == ESP_OK) {
        size_t len;
        if ( (err = nvs_get_str(nvs, name, NULL, &len)) == ESP_OK) {
            *param = (char *)malloc(len);
            if (*param == NULL) {
                nvs_close(nvs);
                return ESP_ERR_NO_MEM;
            }
            err = nvs_get_str(nvs, name, *param, &len);
            ESP_LOGI(TAG, "%s %s", name, *param);
        } else {
            /* Key missing (NVS_NOT_FOUND) is the common case for optional keys;
             * must still close the handle here or it leaks on every lookup —
             * e.g. http_open_fn reads "wan_access" on every connection. */
            nvs_close(nvs);
            return err;
        }
        nvs_close(nvs);
    } else {
        return err;
    }
    return ESP_OK;
}

