martin-ger/esp32_PPPoE_router/components/cmd_router/cmd_router.c
esp_err_t get_config_param_int(char* name, int* param)
{
    nvs_handle_t nvs;

    esp_err_t err = nvs_open(PARAM_NAMESPACE, NVS_READONLY, &nvs);
    if (err == ESP_OK) {
        if ( (err = nvs_get_i32(nvs, name, (int32_t*)(param))) == ESP_OK) {
            //ESP_LOGI(TAG, "%s %d", name, *param);
        } else {
            /* Key missing (NVS_NOT_FOUND) is the common case for optional keys;
             * must still close the handle here or it leaks on every lookup —
             * e.g. http_open_fn reads "wan_access" on every connection. */
            nvs_close(nvs);
            return err;
        }
        nvs_close(nvs);
    } else {
        return err;
    }
    return ESP_OK;
}

esp_err_t get_config_param_blob(char* name, uint8_t** blob, size_t blob_len)
{
    nvs_handle_t nvs;

    esp_err_t err = nvs_open(PARAM_NAMESPACE, NVS_READONLY, &nvs);
    if (err == ESP_OK) {
        size_t len;
        if ( (err = nvs_get_blob(nvs, name, NULL, &len)) == ESP_OK) {
            if (len != blob_len) {
                nvs_close(nvs);
                return ESP_ERR_NVS_INVALID_LENGTH;
            }
            *blob = (uint8_t *)malloc(len);
            if (*blob == NULL) {
                nvs_close(nvs);
                return ESP_ERR_NO_MEM;
            }
            err = nvs_get_blob(nvs, name, *blob, &len);
            ESP_LOGI(TAG, "%s: %d", name, len);
        } else {
            /* Key missing (NVS_NOT_FOUND) is the common case for optional keys;
             * must still close the handle here or it leaks on every lookup —
             * e.g. http_open_fn reads "wan_access" on every connection. */
            nvs_close(nvs);
            return err;
        }
        nvs_close(nvs);
    } else {
        return err;
    }
    return ESP_OK;
}

esp_err_t set_config_param_str(const char* name, const char* value)
{
    nvs_handle_t nvs;
    esp_err_t err = nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &nvs);
    if (err != ESP_OK) return err;
    ESP_LOGI(TAG, "Set config: %s %s", name, value);
    err = nvs_set_str(nvs, name, value);
    if (err == ESP_OK) err = nvs_commit(nvs);
    nvs_close(nvs);
    return err;
}

void update_web_wan_acl(int wan_access)
{
    int web_port = 80;
    get_config_param_int("web_port", &web_port);

    if (!wan_access) {
        /* Install block rule if not already present.
         * Search fresh — acl_delete compacts the list so stored indices go stale. */
        acl_lock();
        acl_entry_t *rules = acl_get_rules(ACL_TO_ESP);
        bool found = false;
        for (int i = 0; i < MAX_ACL_ENTRIES; i++) {
            if (rules[i].valid && rules[i].proto == ACL_PROTO_TCP &&
                rules[i].d_port == (uint16_t)web_port && rules[i].allow == ACL_DENY &&
                rules[i].src == 0 && rules[i].dest == 0) {
                found = true;
                break;
            }
        }
        acl_unlock();
        if (!found) {
            bool ok = acl_add(ACL_TO_ESP, 0, 0, 0, 0, ACL_PROTO_TCP, 0, (uint16_t)web_port, ACL_DENY);
            if (ok) {
                ESP_LOGI(TAG, "WAN block rule installed for web port %d", web_port);
            } else {
                ESP_LOGW(TAG, "Could not install WAN block rule for web port %d (ACL full?)", web_port);
            }
        }
    } else {
        /* Find and remove rule — search fresh each time */
        acl_lock();
        acl_entry_t *rules = acl_get_rules(ACL_TO_ESP);
        int slot = -1;
        for (int i = 0; i < MAX_ACL_ENTRIES; i++) {
            if (rules[i].valid && rules[i].proto == ACL_PROTO_TCP &&
                rules[i].d_port == (uint16_t)web_port && rules[i].allow == ACL_DENY &&
                rules[i].src == 0 && rules[i].dest == 0) {
                slot = i;
                break;
            }
        }
        acl_unlock();
        if (slot >= 0) {
            acl_delete(ACL_TO_ESP, (uint8_t)slot);
            ESP_LOGI(TAG, "WAN block rule removed for web port %d", web_port);
        }
    }
}

esp_err_t set_config_param_int(const char* name, int32_t value)
{
    nvs_handle_t nvs;
    esp_err_t err = nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &nvs);
    if (err != ESP_OK) return err;
    ESP_LOGI(TAG, "Set config: %s %d", name, value);
    err = nvs_set_i32(nvs, name, value);
    if (err == ESP_OK) err = nvs_commit(nvs);
    nvs_close(nvs);
    return err;
}

esp_err_t set_config_param_blob(const char* name, const void* data, size_t len)
{
    nvs_handle_t nvs;
    esp_err_t err = nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &nvs);
    if (err != ESP_OK) return err;
    err = nvs_set_blob(nvs, name, data, len);
    if (err == ESP_OK) err = nvs_commit(nvs);
    nvs_close(nvs);
    return err;
}

/* Convert a CIDR prefix length (0-32) into a dotted-decimal netmask string. */
static void prefix_to_netmask(int prefix, char *out, size_t out_len)
{
    if (prefix < 0) prefix = 0;
    if (prefix > 32) prefix = 32;
    uint32_t mask = prefix ? (0xFFFFFFFFu << (32 - prefix)) : 0;
    snprintf(out, out_len, "%u.%u.%u.%u",
             (unsigned)((mask >> 24) & 0xFF), (unsigned)((mask >> 16) & 0xFF),
             (unsigned)((mask >> 8) & 0xFF),  (unsigned)(mask & 0xFF));
}

/* Trim leading/trailing ASCII whitespace in place; returns a pointer into s. */
static char *trim_ws(char *s)
{
    while (*s && isspace((unsigned char)*s)) s++;
    if (*s == '\0') return s;
    char *end = s + strlen(s) - 1;
    while (end > s && isspace((unsigned char)*end)) *end-- = '\0';
    return s;
}

/* Parse a standard WireGuard .conf file and persist the mapped vpn_* settings.
 * Maps [Interface]/[Peer] keys onto this router's existing NVS parameters; see
 * vpn_config.h. Sets vpn_enabled=1 on success. IPv6 addresses are skipped. */
esp_err_t vpn_import_conf(const char *text)
{
    if (text == NULL) return ESP_ERR_INVALID_ARG;

    char *buf = strdup(text);
    if (!buf) return ESP_ERR_NO_MEM;

    char privkey[128] = "", pubkey[128] = "", psk[128] = "";
    char endpoint_host[128] = "", address_ip[48] = "", netmask[16] = "", dns[128] = "";
    int port = 51820, keepalive = 0, route_all = -1;
    bool have_port = false;

