martin-ger/esp32_PPPoE_router/components/cmd_router/cmd_router.c
    char *save = NULL;
    for (char *line = strtok_r(buf, "\n", &save); line; line = strtok_r(NULL, "\n", &save)) {
        char *p = trim_ws(line);
        if (*p == '\0' || *p == '#' || *p == ';' || *p == '[') continue;  /* blank/comment/section */

        char *eq = strchr(p, '=');
        if (!eq) continue;
        *eq = '\0';
        char *key = trim_ws(p);
        char *val = trim_ws(eq + 1);
        if (*val == '\0') continue;

        if (strcasecmp(key, "PrivateKey") == 0) {
            strlcpy(privkey, val, sizeof(privkey));
        } else if (strcasecmp(key, "PublicKey") == 0) {
            strlcpy(pubkey, val, sizeof(pubkey));
        } else if (strcasecmp(key, "PresharedKey") == 0) {
            strlcpy(psk, val, sizeof(psk));
        } else if (strcasecmp(key, "Address") == 0) {
            char *comma = strchr(val, ',');           /* first entry only (IPv4) */
            if (comma) *comma = '\0';
            char *first = trim_ws(val);
            char *slash = strchr(first, '/');
            int prefix = 32;
            if (slash) { *slash = '\0'; prefix = atoi(slash + 1); }
            strlcpy(address_ip, trim_ws(first), sizeof(address_ip));
            prefix_to_netmask(prefix, netmask, sizeof(netmask));
        } else if (strcasecmp(key, "DNS") == 0) {
            char *comma = strchr(val, ',');           /* first DNS only */
            if (comma) *comma = '\0';
            strlcpy(dns, trim_ws(val), sizeof(dns));
        } else if (strcasecmp(key, "Endpoint") == 0) {
            char *colon = strrchr(val, ':');          /* host:port */
            if (colon) { *colon = '\0'; port = atoi(colon + 1); have_port = true; }
            strlcpy(endpoint_host, trim_ws(val), sizeof(endpoint_host));
        } else if (strcasecmp(key, "PersistentKeepalive") == 0) {
            keepalive = atoi(val);
        } else if (strcasecmp(key, "AllowedIPs") == 0) {
            route_all = (strstr(val, "0.0.0.0/0") != NULL) ? 1 : 0;
        }
    }

    free(buf);

    if (privkey[0] == '\0' || pubkey[0] == '\0' ||
        endpoint_host[0] == '\0' || address_ip[0] == '\0') {
        ESP_LOGE(TAG, "WireGuard import: missing required field (need PrivateKey, PublicKey, Endpoint, Address)");
        return ESP_ERR_INVALID_ARG;
    }

    set_config_param_str("vpn_privkey", privkey);
    set_config_param_str("vpn_pubkey", pubkey);
    set_config_param_str("vpn_psk", psk);              /* may be empty */
    set_config_param_str("vpn_endpoint", endpoint_host);
    set_config_param_str("vpn_ip", address_ip);
    set_config_param_str("vpn_mask", netmask[0] ? netmask : "255.255.255.255");
    if (dns[0]) set_config_param_str("vpn_dns", dns);
    if (have_port) set_config_param_int("vpn_port", port);
    set_config_param_int("vpn_ka", keepalive);
    if (route_all >= 0) set_config_param_int("vpn_rall", route_all);
    set_config_param_int("vpn_enabled", 1);

    ESP_LOGI(TAG, "WireGuard config imported (endpoint=%s:%d ip=%s dns=%s route_all=%d)",
             endpoint_host, port, address_ip, dns[0] ? dns : "(none)", route_all);
    return ESP_OK;
}

void register_router(void)
{
    register_show();
#if !CONFIG_ETH_UPLINK
    register_set_sta();
    register_set_mac();
#else
    register_set_ap_mac_only();
#endif
#if !CONFIG_ETH_UPLINK
    register_scan();
#endif
    register_set_sta_static();
    register_set_ap();
    register_set_ap_ip();
    register_set_ap_dns();
    register_dhcp_reserve();
    register_portmap();
    register_acl();
    register_bytes();
#if CONFIG_PCAP_CAPTURE
    register_pcap();
#endif
    register_web_ui();
    register_set_router_password();
    register_set_led_gpio();
    register_set_led_lowactive();
    register_set_ttl();
    register_client_stats_cmd();
    register_set_ap_nat();
    register_set_tx_power();
    register_set_wifi_country();
    register_set_ap_hidden();
    register_set_ap_auth();
    register_ap();
#if CONFIG_ETH_UPLINK
    register_set_ap_channel();
#endif
    register_set_hostname();
#if WIFI_HAS_5GHZ
    register_set_sta_band();
#endif
#if defined(CONFIG_IDF_TARGET_ESP32C6)
    register_set_rf_switch();
#endif
    register_remote_console_cmd();
    register_syslog_cmd();
    register_set_tz();
    register_set_pppoe();
    register_set_vpn();
#if CONFIG_DDNS_ENABLED
    register_ddns_cmd();
#endif
#if CONFIG_ETH_UPLINK && defined(CONFIG_ETH_DRIVER_W5500)
    register_set_spi_clock();
    register_w5500();
#endif
}

#if !CONFIG_ETH_UPLINK
/** Arguments used by 'set_sta' function */
static struct {
    struct arg_str* ssid;
    struct arg_str* password;
    struct arg_str* ent_username;
    struct arg_str* ent_identity;
    struct arg_int* eap_method;
    struct arg_int* ttls_phase2;
    struct arg_int* cert_bundle;
    struct arg_int* no_time_check;
    struct arg_end* end;
} set_sta_arg;

/* 'set_sta' command */
int set_sta(int argc, char **argv)
{
    esp_err_t err;
    nvs_handle_t nvs;

    int nerrors = arg_parse(argc, argv, (void **) &set_sta_arg);
    if (nerrors != 0) {
        arg_print_errors(stderr, set_sta_arg.end, argv[0]);
        return 1;
    }

    preprocess_string((char*)set_sta_arg.ssid->sval[0]);
    preprocess_string((char*)set_sta_arg.password->sval[0]);

    err = nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &nvs);
    if (err != ESP_OK) {
        return err;
    }

    err = nvs_set_str(nvs, "ssid", set_sta_arg.ssid->sval[0]);
    if (err == ESP_OK) {
        err = nvs_set_str(nvs, "passwd", set_sta_arg.password->sval[0]);
        if (err == ESP_OK) {
            if (set_sta_arg.ent_username->count > 0) {
                err = nvs_set_str(nvs, "ent_username", set_sta_arg.ent_username->sval[0]);
            }
            else {
                err = nvs_set_str(nvs, "ent_username", "");
            }

            if (err == ESP_OK) {
                if (set_sta_arg.ent_identity->count > 0) {
                    err = nvs_set_str(nvs, "ent_identity", set_sta_arg.ent_identity->sval[0]);
                }
                else {
                    err = nvs_set_str(nvs, "ent_identity", "");
                }

                if (err == ESP_OK) {
                    // Save WPA2-Enterprise settings
                    if (set_sta_arg.eap_method->count > 0) {
                        nvs_set_i32(nvs, "eap_method", set_sta_arg.eap_method->ival[0]);
                        eap_method = set_sta_arg.eap_method->ival[0];
                    }
                    if (set_sta_arg.ttls_phase2->count > 0) {
                        nvs_set_i32(nvs, "ttls_phase2", set_sta_arg.ttls_phase2->ival[0]);
                        ttls_phase2 = set_sta_arg.ttls_phase2->ival[0];
                    }
                    if (set_sta_arg.cert_bundle->count > 0) {
                        nvs_set_i32(nvs, "cert_bundle", set_sta_arg.cert_bundle->ival[0]);
                        use_cert_bundle = set_sta_arg.cert_bundle->ival[0];
                    }
                    if (set_sta_arg.no_time_check->count > 0) {
                        nvs_set_i32(nvs, "no_time_chk", set_sta_arg.no_time_check->ival[0]);
                        disable_time_check = set_sta_arg.no_time_check->ival[0];
                    }

                    err = nvs_commit(nvs);
                    if (err == ESP_OK) {
                        ESP_LOGI(TAG, "STA settings %s/%s stored.", set_sta_arg.ssid->sval[0], set_sta_arg.password->sval[0]);
                    }
                }
            }
        }
    }
    nvs_close(nvs);
    return err;
}

static void register_set_sta(void)
{
    set_sta_arg.ssid = arg_str1(NULL, NULL, "<ssid>", "SSID");
    set_sta_arg.password = arg_str1(NULL, NULL, "<passwd>", "Password");
    set_sta_arg.ent_username = arg_str0("-u", "--username", "<ent_username>", "Enterprise username");
    set_sta_arg.ent_identity = arg_str0("-a", "--identity", "<ent_identity>", "Enterprise identity");
    set_sta_arg.eap_method = arg_int0("-e", "--eap", "<0-3>", "EAP method (0=Auto,1=PEAP,2=TTLS,3=TLS)");
    set_sta_arg.ttls_phase2 = arg_int0("-p", "--phase2", "<0-3>", "TTLS phase2 (0=MSCHAPv2,1=MSCHAP,2=PAP,3=CHAP)");
    set_sta_arg.cert_bundle = arg_int0("-c", "--cert-bundle", "<0|1>", "Use CA cert bundle");
    set_sta_arg.no_time_check = arg_int0("-t", "--no-time-check", "<0|1>", "Skip cert time check");
    set_sta_arg.end = arg_end(6);

    const esp_console_cmd_t cmd = {
        .command = "set_sta",
        .help = "Set SSID and password of the STA interface",
        .hint = NULL,
        .func = &set_sta,
        .argtable = &set_sta_arg
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
#endif


