martin-ger/esp32_PPPoE_router/components/cmd_router/cmd_router.c
    return err;
}

static void register_set_hostname(void)
{
    set_hostname_arg.name = arg_str1(NULL, NULL, "<name>", "DHCP hostname (empty to clear)");
    set_hostname_arg.end = arg_end(1);

    const esp_console_cmd_t cmd = {
        .command = "set_hostname",
        .help = "Set DHCP client hostname for upstream network (empty to use default)",
        .hint = NULL,
        .func = &set_hostname,
        .argtable = &set_hostname_arg
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'web_ui' command */
static int web_ui_cmd(int argc, char **argv)
{
    if (argc < 2) {
        /* Show current status */
        char* lock = NULL;
        get_config_param_str("web_disabled", &lock);
        bool enabled = (lock == NULL || strcmp(lock, "0") == 0);
        int port = 80;
        get_config_param_int("web_port", &port);
        printf("Web interface: %s (port %d)\n", enabled ? "enabled" : "disabled", port);
        printf("\nUsage:\n");
        printf("  web_ui enable           - Enable web interface (after reboot)\n");
        printf("  web_ui disable          - Disable web interface (after reboot)\n");
        printf("  web_ui port <port>      - Set web server port (after reboot)\n");
        if (lock != NULL) free(lock);
        return 0;
    }

    const char *action = argv[1];
    esp_err_t err;

    if (strcmp(action, "enable") == 0) {
        err = set_config_param_str("web_disabled", "0");
        if (err == ESP_OK) {
            ESP_LOGW(TAG, "Web interface enabled via CLI.");
            printf("Web interface will be enabled after reboot.\n");
        }
    } else if (strcmp(action, "disable") == 0) {
        err = set_config_param_str("web_disabled", "1");
        if (err == ESP_OK) {
            ESP_LOGW(TAG, "Web interface disabled via CLI.");
            printf("Web interface will be disabled after reboot.\n");
            printf("Use 'web_ui enable' to re-enable it.\n");
        }
    } else if (strcmp(action, "port") == 0) {
        if (argc < 3) {
            int port = 80;
            get_config_param_int("web_port", &port);
            printf("Current web server port: %d\n", port);
            printf("Usage: web_ui port <port>\n");
            return 0;
        }
        int port = atoi(argv[2]);
        if (port < 1 || port > 65535) {
            printf("Invalid port: %s (must be 1-65535)\n", argv[2]);
            return 1;
        }
        err = set_config_param_int("web_port", port);
        if (err == ESP_OK) {
            ESP_LOGI(TAG, "Web server port set to %d.", port);
            printf("Web server port set to %d (after reboot).\n", port);
        }
    } else if (strcmp(action, "wan_access") == 0) {
        if (argc < 3) {
            int val = 0;
            get_config_param_int("wan_access", &val);
            printf("Web internet access: %s\n", val ? "enabled" : "disabled");
            printf("Usage: web_ui wan_access <on|off>\n");
            return 0;
        }
        int val = (strcmp(argv[2], "on") == 0 || strcmp(argv[2], "enable") == 0 || strcmp(argv[2], "1") == 0) ? 1 : 0;
        if (val && !is_web_password_set()) {
            printf("Error: cannot enable WAN access without a router password.\n");
            printf("Set a password first: set_router_password <password>\n");
            return 1;
        }
        err = set_config_param_int("wan_access", val);
        if (err == ESP_OK) {
            printf("Web interface access from WAN: %s (effective immediately).\n",
                   val ? "enabled" : "disabled");
            ESP_LOGW(TAG, "Interface access from WAN %s.", val ? "enabled" : "disabled");
            update_web_wan_acl(val);
        }
    } else {
        printf("Unknown action: %s\n", action);
        printf("Usage: web_ui <enable|disable|port|wan_access>\n");
        return 1;
    }

    return err;
}

static void register_web_ui(void)
{
    const esp_console_cmd_t cmd = {
        .command = "web_ui",
        .help = "Manage the web interface\n"
                "  web_ui                          - Show current status\n"
                "  web_ui enable                   - Enable web interface (after reboot)\n"
                "  web_ui disable                  - Disable web interface (after reboot)\n"
                "  web_ui port <port>              - Set web server port (after reboot)\n"
                "  web_ui wan_access <on|off>      - Allow/deny access from WAN side (on/enable/1 or off/disable/0)",
        .hint = " <enable|disable|port|wan_access>",
        .func = &web_ui_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* --- Password hashing (SHA-256 + 16-byte salt) --- */
/* NVS key "web_password" stores "salt_hex:hash_hex" (32 + 1 + 64 = 97 chars) */

#define PW_SALT_LEN 16
#define PW_HASH_LEN 32   /* SHA-256 output */

static void pw_bytes_to_hex(const uint8_t *src, size_t len, char *out)
{
    for (size_t i = 0; i < len; i++) {
        sprintf(out + i * 2, "%02x", src[i]);
    }
    out[len * 2] = '\0';
}

static int pw_hex_to_bytes(const char *src, uint8_t *dst, size_t len)
{
    for (size_t i = 0; i < len; i++) {
        unsigned int b;
        if (sscanf(src + i * 2, "%2x", &b) != 1) return -1;
        dst[i] = (uint8_t)b;
    }
    return 0;
}

static void pw_compute_hash(const uint8_t *salt, size_t salt_len,
                            const char *plaintext, uint8_t *hash_out)
{
    mbedtls_sha256_context ctx;
    mbedtls_sha256_init(&ctx);
    mbedtls_sha256_starts(&ctx, 0);  /* 0 = SHA-256 (not 224) */
    mbedtls_sha256_update(&ctx, salt, salt_len);
    mbedtls_sha256_update(&ctx, (const uint8_t *)plaintext, strlen(plaintext));
    mbedtls_sha256_finish(&ctx, hash_out);
    mbedtls_sha256_free(&ctx);
}

bool is_web_password_set(void)
{
    nvs_handle_t nvs;
    if (nvs_open(PARAM_NAMESPACE, NVS_READONLY, &nvs) != ESP_OK) return false;

    size_t len = 0;
    esp_err_t err = nvs_get_str(nvs, "web_password", NULL, &len);
    nvs_close(nvs);
    return (err == ESP_OK && len > 1);  /* len includes null terminator */
}

