martin-ger/esp32_PPPoE_router/components/cmd_router/cmd_router.c
bool verify_web_password(const char *plaintext)
{
    nvs_handle_t nvs;
    if (nvs_open(PARAM_NAMESPACE, NVS_READONLY, &nvs) != ESP_OK) return false;

    size_t stored_len = 0;
    esp_err_t err = nvs_get_str(nvs, "web_password", NULL, &stored_len);
    if (err != ESP_OK || stored_len <= 1) { nvs_close(nvs); return false; }

    char *stored = malloc(stored_len);
    if (!stored) { nvs_close(nvs); return false; }
    nvs_get_str(nvs, "web_password", stored, &stored_len);
    nvs_close(nvs);

    /* New format: "salt_hex:hash_hex" (32 + 1 + 64 = 97 chars + null) */
    char *colon = strchr(stored, ':');
    if (colon && (colon - stored) == PW_SALT_LEN * 2
              && strlen(colon + 1) == PW_HASH_LEN * 2) {
        /* Hashed format */
        uint8_t salt[PW_SALT_LEN], stored_hash[PW_HASH_LEN], computed_hash[PW_HASH_LEN];
        if (pw_hex_to_bytes(stored, salt, PW_SALT_LEN) != 0 ||
            pw_hex_to_bytes(colon + 1, stored_hash, PW_HASH_LEN) != 0) {
            free(stored);
            return false;
        }
        pw_compute_hash(salt, PW_SALT_LEN, plaintext, computed_hash);
        free(stored);

        /* Constant-time comparison */
        volatile int diff = 0;
        for (int i = 0; i < PW_HASH_LEN; i++) {
            diff |= stored_hash[i] ^ computed_hash[i];
        }
        return diff == 0;
    }

    /* Legacy plaintext format - compare directly, then migrate */
    bool match = (strcmp(stored, plaintext) == 0);
    free(stored);
    if (match) {
        /* Silently migrate to hashed format */
        set_web_password_hashed(plaintext);
    }
    return match;
}

esp_err_t set_web_password_hashed(const char *plaintext)
{
    if (plaintext[0] == '\0') {
        /* Empty = disable password */
        return set_config_param_str("web_password", "");
    }

    uint8_t salt[PW_SALT_LEN], hash[PW_HASH_LEN];
    esp_fill_random(salt, PW_SALT_LEN);
    pw_compute_hash(salt, PW_SALT_LEN, plaintext, hash);

    /* Format: "salt_hex:hash_hex" */
    char buf[PW_SALT_LEN * 2 + 1 + PW_HASH_LEN * 2 + 1];
    pw_bytes_to_hex(salt, PW_SALT_LEN, buf);
    buf[PW_SALT_LEN * 2] = ':';
    pw_bytes_to_hex(hash, PW_HASH_LEN, buf + PW_SALT_LEN * 2 + 1);

    return set_config_param_str("web_password", buf);
}

/* 'set_router_password' command */
static int set_router_password_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: set_router_password <password>\n");
        printf("Use empty string \"\" to disable password protection\n");
        return 1;
    }

    esp_err_t err = set_web_password_hashed(argv[1]);
    if (err == ESP_OK) {
        if (argv[1][0] == '\0') {
            ESP_LOGW(TAG, "Web password protection disabled via CLI.");
            printf("Password protection disabled.\n");
            int wan_access = 0;
            get_config_param_int("wan_access", &wan_access);
            if (wan_access) {
                set_config_param_int("wan_access", 0);
                printf("WAN access disabled (requires a password to be set).\n");
                update_web_wan_acl(0);
            }
        } else {
            ESP_LOGW(TAG, "Web password changed via CLI.");
            printf("Password updated successfully.\n");
        }
    } else {
        printf("Failed to set password\n");
    }
    return err;
}

static void register_set_router_password(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_router_password",
        .help = "Set router password for web and remote console (empty string to disable)",
        .hint = NULL,
        .func = &set_router_password_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/** Arguments used by 'portmap' function */
static struct {
    struct arg_str *add_del;
    struct arg_str *TCP_UDP;
    struct arg_int *ext_port;
    struct arg_str *int_ip;
    struct arg_int *int_port;
    struct arg_end *end;
} portmap_args;

/* 'portmap' command */
int portmap(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **) &portmap_args);
    if (nerrors != 0) {
        arg_print_errors(stderr, portmap_args.end, argv[0]);
        return 1;
    }

    bool add;
    if (strcmp((char *)portmap_args.add_del->sval[0], "add")== 0) {
        add = true;
    } else if (strcmp((char *)portmap_args.add_del->sval[0], "del")== 0) {
        add = false;
    } else {
        printf("Must be 'add' or 'del'\n");
        return 1;
    }

    uint8_t tcp_udp;
    if (strcmp((char *)portmap_args.TCP_UDP->sval[0], "TCP")== 0) {
        tcp_udp = PROTO_TCP;
    } else if (strcmp((char *)portmap_args.TCP_UDP->sval[0], "UDP")== 0) {
        tcp_udp = PROTO_UDP;
    } else {
        printf("Must be 'TCP' or 'UDP'\n");
        return 1;
    }

    uint16_t ext_port = portmap_args.ext_port->ival[0];
    const char *ip_str = (char *)portmap_args.int_ip->sval[0];
    uint32_t int_ip = esp_ip4addr_aton(ip_str);

    /* If IP parsing failed (returns IPADDR_NONE), try device name */
    if (int_ip == IPADDR_NONE) {
        if (!resolve_device_name_to_ip(ip_str, &int_ip)) {
            printf("Invalid IP address or device name: %s\n", ip_str);
            return 1;
        }
    }
    uint16_t int_port = portmap_args.int_port->ival[0];

    if (add) {
        /* Validate internal IP is in same /24 network as AP interface */
        if ((int_ip & 0x00FFFFFF) != (my_ap_ip & 0x00FFFFFF)) {
            ip4_addr_t ap_addr, int_addr;
            ap_addr.addr = my_ap_ip;
            int_addr.addr = int_ip;
            printf("Internal IP " IPSTR " must be in same network as AP (" IPSTR "/24)\n",
                   IP2STR(&int_addr), IP2STR(&ap_addr));
            return 1;
        }

        /* Check if external port is already in use for this protocol */
        for (int i = 0; i < IP_PORTMAP_MAX; i++) {
            if (portmap_tab[i].valid &&
                portmap_tab[i].proto == tcp_udp &&
                portmap_tab[i].mport == ext_port) {
                printf("External port %d/%s is already mapped\n",
                       ext_port, tcp_udp == PROTO_TCP ? "TCP" : "UDP");
                return 1;
            }
        }

        add_portmap(tcp_udp, ext_port, int_ip, int_port);
    } else {
        del_portmap(tcp_udp, ext_port);
    }

    return ESP_OK;
}

