martin-ger/esp32_PPPoE_router/components/cmd_router/cmd_router.c
static void register_portmap(void)
{
    portmap_args.add_del = arg_str1(NULL, NULL, "[add|del]", "add or delete portmapping");
    portmap_args.TCP_UDP = arg_str1(NULL, NULL, "[TCP|UDP]", "TCP or UDP port");
    portmap_args.ext_port = arg_int1(NULL, NULL, "<ext_portno>", "external port number");
    portmap_args.int_ip = arg_str1(NULL, NULL, "<int_ip>", "internal IP or device name");
    portmap_args.int_port = arg_int1(NULL, NULL, "<int_portno>", "internal port number");
    portmap_args.end = arg_end(5);

    const esp_console_cmd_t cmd = {
        .command = "portmap",
        .help = "Add or delete a portmapping to the router",
        .hint = NULL,
        .func = &portmap,
        .argtable = &portmap_args
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'show' command arguments */
static struct {
    struct arg_str *type;
    struct arg_end *end;
} show_args;

/* 'show' command implementation */
static int show(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **) &show_args);
    if (nerrors != 0) {
        arg_print_errors(stderr, show_args.end, argv[0]);
        return 1;
    }

    if (show_args.type->count == 0) {
        printf("Usage: show <status|config|mappings|route|acl|pppoe|ota>\n");
        printf("  status   - Show router status (connection, clients, memory)\n");
        printf("  config   - Show router configuration (AP/STA settings)\n");
        printf("  mappings - Show DHCP pool, reservations and port mappings\n");
        printf("  route    - Show routing table (interfaces, connected + default routes)\n");
        printf("  acl      - Show firewall ACL rules\n");
        printf("  pppoe    - Show PPPoE DSL status and config\n");
        return 1;
    }

    const char *type = show_args.type->sval[0];

    if (strcmp(type, "status") == 0) {
        // Show status
        printf("Router Status:\n");
        printf("==============\n");

        // Uptime
        char uptime_str[32];
        format_uptime(get_uptime_seconds(), uptime_str, sizeof(uptime_str));
        char boot_time_str[32];
        format_boot_time(boot_time_str, sizeof(boot_time_str));
        printf("Uptime: %s (since %s)\n", uptime_str, boot_time_str);

        // Connection status
#if CONFIG_ETH_UPLINK
        printf("Ethernet:   %s\n", eth_link_up ? "link up" : "link down");
        if (pppoe_enabled) {
            if (pppoe_is_connected()) {
                ip4_addr_t ppp_addr;
                ppp_addr.addr = pppoe_ip;
                printf("PPPoE:      connected (" IPSTR ")\n", IP2STR(&ppp_addr));
            } else if (pppoe_connected) {
                printf("PPPoE:      negotiating\n");
            } else {
                printf("PPPoE:      disconnected\n");
            }
        }
#else
        if (ap_connect) {
            wifi_ap_record_t ap_info;
            if (esp_wifi_sta_get_ap_info(&ap_info) == ESP_OK) {
#if WIFI_HAS_5GHZ
                printf("Uplink STA: connected (ch %d, %s, %d dBm)\n",
                       ap_info.primary,
                       ap_info.primary > 14 ? "5 GHz" : "2.4 GHz",
                       ap_info.rssi);
#else
                printf("Uplink STA: connected (ch %d, %d dBm)\n", ap_info.primary, ap_info.rssi);
#endif
            } else {
                printf("Uplink STA: connected\n");
            }
        } else {
            printf("Uplink STA: not connected\n");
        }
#endif
        if (ap_connect) {
            ip4_addr_t addr;
            addr.addr = my_ip;
            printf("Uplink IP: " IPSTR "\n", IP2STR(&addr));
        } else {
            printf("Uplink IP: none\n");
        }

        // Current DNS server(s) handed to / used by clients (AP netif DNS_MAIN/BACKUP)
        {
            esp_netif_t *ap_h = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
            esp_netif_dns_info_t dns_info;
            if (ap_h && esp_netif_get_dns_info(ap_h, ESP_NETIF_DNS_MAIN, &dns_info) == ESP_OK
                && !ip4_addr_isany_val(dns_info.ip.u_addr.ip4)) {
                printf("DNS: " IPSTR, IP2STR(&dns_info.ip.u_addr.ip4));
                if (esp_netif_get_dns_info(ap_h, ESP_NETIF_DNS_BACKUP, &dns_info) == ESP_OK
                    && !ip4_addr_isany_val(dns_info.ip.u_addr.ip4)) {
                    printf(", " IPSTR, IP2STR(&dns_info.ip.u_addr.ip4));
                }
                printf("\n");
            } else {
                printf("DNS: none\n");
            }
        }

        // Byte counts
        char _sent_buf[16], _recv_buf[16];
        format_bytes_human(get_sta_bytes_sent(), _sent_buf, sizeof(_sent_buf));
        format_bytes_human(get_sta_bytes_received(), _recv_buf, sizeof(_recv_buf));
        printf("Bytes sent/received: %s / %s\n", _sent_buf, _recv_buf);

#if SOC_TEMP_SENSOR_SUPPORTED
        {
            temperature_sensor_handle_t tsens;
            temperature_sensor_config_t tsens_cfg = TEMPERATURE_SENSOR_CONFIG_DEFAULT(20, 100);
            if (temperature_sensor_install(&tsens_cfg, &tsens) == ESP_OK) {
                float celsius = 0.0f;
                temperature_sensor_enable(tsens);
                if (temperature_sensor_get_celsius(tsens, &celsius) == ESP_OK) {
                    printf("CPU temperature: %.1f °C\n", celsius);
                }
                temperature_sensor_disable(tsens);
                temperature_sensor_uninstall(tsens);
            }
        }
#endif

        // NAPT table usage
        napt_stats_t napt;
        get_napt_stats(&napt);
        printf("NAPT entries: %lu/%lu (TCP %lu, UDP %lu, ICMP %lu)\n",
               (unsigned long)napt.total, (unsigned long)napt.max,
               (unsigned long)napt.tcp, (unsigned long)napt.udp, (unsigned long)napt.icmp);

        // Free heap
        printf("Free heap: %lu bytes\n", (unsigned long)esp_get_free_heap_size());

        // AP interface state
        printf("AP interface: %s\n", ap_disabled ? "disabled" : "enabled");

        // Access warning
        int wan_access = 0;
        get_config_param_int("wan_access", &wan_access);
        if (wan_access) {
            printf("\nWARNING: WAN access is enabled - management interfaces reachable from internet!\n");
        }

        // Connected clients
        resync_connect_count();
        printf("Connected clients: %u\n", connect_count);
        if (connect_count > 0) {
            connected_client_t clients[8];
            int count = get_connected_clients(clients, 8);

            if (count > 0) {
                // Fetch per-client traffic stats only when enabled
                client_stats_entry_t stats[CLIENT_STATS_MAX];
                int stats_count = client_stats_enabled ? client_stats_get_all(stats, CLIENT_STATS_MAX) : 0;

                printf("\nClient Details:\n");
                if (client_stats_enabled) {
                    printf("MAC Address       IP Address       Device Name          TX / RX\n");
                    printf("----------------  ---------------  -------------------  ------------------\n");
                } else {
                    printf("MAC Address       IP Address       Device Name\n");
                    printf("----------------  ---------------  -------------------\n");
                }

                for (int i = 0; i < count; i++) {
                    char mac_str[18];
                    sprintf(mac_str, "%02X:%02X:%02X:%02X:%02X:%02X",
                            clients[i].mac[0], clients[i].mac[1], clients[i].mac[2],
                            clients[i].mac[3], clients[i].mac[4], clients[i].mac[5]);

