martin-ger/esp32_PPPoE_router/components/cmd_router/cmd_router.c
    } else if (strcmp(type, "mappings") == 0) {
        // Show mappings
        printf("Network Mappings:\n");
        printf("=================\n");

        printf("\nDHCP Pool:\n");
        print_dhcp_pool();

        printf("\nDHCP Reservations:\n");
        print_dhcp_reservations();

        printf("\nPort Mappings:\n");
        print_portmap_tab();

    } else if (strcmp(type, "route") == 0) {
        // Routing table. lwIP here has no general FIB: routing is each netif's
        // IP&netmask (its connected route) plus the single netif_default, whose
        // gateway is the default route. We walk the raw lwIP netif_list (not
        // esp_netif) so the PPPoE uplink and the WireGuard netif — both added
        // directly via lwIP (pppapi / netif_add) and not managed by esp_netif —
        // also show up. When PPPoE is the uplink, ppp_netif is netif_default and
        // its gateway is the PPP peer address (the real default route).
        //
        // NOTE: do NOT reverse-map an arbitrary lwIP netif to esp_netif. The PPP
        // and WG netifs' ->state point to their own device contexts, so
        // esp_netif_get_handle_from_netif_impl() would hand back a bogus pointer
        // that crashes when dereferenced. Instead resolve the known managed
        // handles up front and match by impl pointer; anything else is raw.
        struct netif *def = netif_default;
        ip4_addr_t def_gw = { 0 };
        char def_name[8] = "?";
        struct netif *nif;

        esp_netif_t *ap_h  = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
        esp_netif_t *sta_h = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
        esp_netif_t *eth_h = esp_netif_get_handle_from_ifkey("ETH_DEF");
        struct netif *ap_if  = ap_h  ? (struct netif *)esp_netif_get_netif_impl(ap_h)  : NULL;
        struct netif *sta_if = sta_h ? (struct netif *)esp_netif_get_netif_impl(sta_h) : NULL;
        struct netif *eth_if = eth_h ? (struct netif *)esp_netif_get_netif_impl(eth_h) : NULL;

        printf("Routing Table:\n");
        printf("==============\n");
        printf("%-10s %-15s %-15s %-15s %4s %-4s %s\n",
               "Iface", "IP", "Netmask", "Gateway", "Prio", "Link", "Default");

        NETIF_FOREACH(nif) {
            ip4_addr_t ip = { .addr = netif_ip4_addr(nif)->addr };
            ip4_addr_t mask = { .addr = netif_ip4_netmask(nif)->addr };
            ip4_addr_t gw = { .addr = netif_ip4_gw(nif)->addr };
            bool is_def = (nif == def);

            esp_netif_t *eh = (nif == ap_if)  ? ap_h
                            : (nif == sta_if) ? sta_h
                            : (nif == eth_if) ? eth_h : NULL;

            // Prefer the esp_netif desc for managed netifs; fall back to the lwIP
            // name for raw ones. PPP netifs are named "pp" by lwIP and the
            // WireGuard tunnel "wg" — relabel the PPPoE uplink as "ppp" so it is
            // obvious which line is the DSL link.
            char name[8];
            snprintf(name, sizeof(name), "%c%c%d", nif->name[0], nif->name[1], nif->num);
            const char *label;
            if (eh != NULL) {
                label = esp_netif_get_desc(eh);
            } else if (nif->name[0] == 'p' && nif->name[1] == 'p') {
                label = "ppp";
            } else {
                label = name;
            }
            if (label == NULL) {
                label = name;
            }

            char prio[6];
            if (eh != NULL) {
                snprintf(prio, sizeof(prio), "%d", esp_netif_get_route_prio(eh));
            } else {
                snprintf(prio, sizeof(prio), "-");
            }

            if (is_def) {
                def_gw.addr = gw.addr;
                snprintf(def_name, sizeof(def_name), "%s", label);
            }

            char ips[16], masks[16], gws[16];
            snprintf(ips, sizeof(ips), IPSTR, IP2STR(&ip));
            snprintf(masks, sizeof(masks), IPSTR, IP2STR(&mask));
            snprintf(gws, sizeof(gws), IPSTR, IP2STR(&gw));
            printf("%-10s %-15s %-15s %-15s %4s %-4s %s\n",
                   label, ips, masks, gws, prio,
                   netif_is_up(nif) ? "up" : "down",
                   is_def ? "*" : "");
        }

        // Derived view: connected routes (one per up netif with an address).
        printf("\nConnected routes:\n");
        NETIF_FOREACH(nif) {
            uint32_t addr = netif_ip4_addr(nif)->addr;
            uint32_t nm = netif_ip4_netmask(nif)->addr;
            if (!netif_is_up(nif) || addr == 0) {
                continue;
            }
            ip4_addr_t net = { .addr = addr & nm };
            int prefix = 0;
            for (uint32_t m = lwip_ntohl(nm); m & 0x80000000u; m <<= 1) {
                prefix++;
            }
            char name[8];
            snprintf(name, sizeof(name), "%c%c%d", nif->name[0], nif->name[1], nif->num);
            esp_netif_t *eh = (nif == ap_if)  ? ap_h
                            : (nif == sta_if) ? sta_h
                            : (nif == eth_if) ? eth_h : NULL;
            const char *label;
            if (eh != NULL) {
                label = esp_netif_get_desc(eh);
            } else if (nif->name[0] == 'p' && nif->name[1] == 'p') {
                label = "ppp";
            } else {
                label = name;
            }
            printf("  " IPSTR "/%d dev %s\n", IP2STR(&net), prefix, label ? label : name);
        }

        if (def != NULL) {
            printf("Default route: via " IPSTR " dev %s\n", IP2STR(&def_gw), def_name);
        } else {
            printf("Default route: none\n");
        }

    } else if (strcmp(type, "acl") == 0) {
        // Show ACL rules with device names
        printf("Firewall ACL Rules:\n");
        printf("===================\n");

        for (int i = 0; i < MAX_ACL_LISTS; i++) {
            acl_print_with_names(i);
        }

    } else if (strcmp(type, "pppoe") == 0) {
        printf("PPPoE DSL:\n");
        printf("==========\n");
        printf("Enabled: %s\n", pppoe_enabled ? "yes" : "no");
        if (pppoe_enabled) {
            const char *state;
            if (pppoe_is_connected()) {
                state = "connected";
            } else if (pppoe_connected) {
                state = "negotiating";
            } else {
                state = "disconnected";
            }
            printf("Status: %s\n", state);
        } else {
            printf("Status: disabled\n");
        }
        printf("Username: %s\n", (pppoe_user && pppoe_user[0]) ? pppoe_user : "<not set>");
        printf("Service: %s\n", (pppoe_service && pppoe_service[0]) ? pppoe_service : "<any>");
        const char *auth_str[] = {"auto", "PAP", "CHAP"};
        printf("Auth Type: %s\n", (pppoe_auth >= 0 && pppoe_auth <= 2) ? auth_str[pppoe_auth] : "auto");
        printf("VLAN ID: %ld%s\n", (long)pppoe_vlan, pppoe_vlan == 0 ? " (none)" : "");
        printf("Baby-jumbo: %s\n", pppoe_babyjumbo ? "yes (MSS=1460, PMTU=1500)" : "no (MSS=1452, PMTU=1492)");
        if (pppoe_ip != 0) {
            ip4_addr_t addr;
            addr.addr = pppoe_ip;
            printf("IP: " IPSTR "\n", IP2STR(&addr));
        } else {
            printf("IP: <not assigned>\n");
        }
        printf("MSS Clamp: %u\n", ap_mss_clamp);
        printf("Path MTU: %u\n", ap_pmtu);

    } else if (strcmp(type, "vpn") == 0) {
        printf("WireGuard VPN:\n");
        printf("==============\n");
        printf("Enabled: %s\n", vpn_enabled ? "yes" : "no");
        if (vpn_enabled) {
            const char *state;
            if (vpn_is_connected()) {
                state = "peer up";
            } else if (vpn_connected) {
                state = "handshake pending";
            } else {
                state = "disconnected";
            }
            printf("Status: %s\n", state);
        } else {
            printf("Status: disabled\n");
        }
        printf("Tunnel IP: %s\n", (vpn_address && vpn_address[0]) ? vpn_address : "<not set>");
        printf("Netmask: %s\n", (vpn_netmask && vpn_netmask[0]) ? vpn_netmask : "255.255.255.0");
        printf("Endpoint: %s:%ld\n", (vpn_endpoint && vpn_endpoint[0]) ? vpn_endpoint : "<not set>", (long)vpn_port);
        printf("Keepalive: %ld sec\n", (long)vpn_keepalive);
        printf("Private Key: %s\n", (vpn_private_key && vpn_private_key[0]) ? "<set>" : "<not set>");
        printf("Public Key: %s\n", (vpn_public_key && vpn_public_key[0]) ? vpn_public_key : "<not set>");
        printf("Preshared Key: %s\n", (vpn_preshared_key && vpn_preshared_key[0]) ? "<set>" : "<not set>");
        printf("MSS Clamp: %u\n", ap_mss_clamp);
        printf("Path MTU: %u\n", ap_pmtu);
        printf("Kill Switch: %s\n", vpn_killswitch ? "on" : "off");
        printf("Route All: %s\n", vpn_route_all ? "yes (all traffic)" : "no (split tunnel)");

    } else if (strcmp(type, "ota") == 0) {
        const esp_partition_t *running = esp_ota_get_running_partition();
        const esp_app_desc_t *app_desc = esp_app_get_description();
        const esp_partition_t *next = esp_ota_get_next_update_partition(NULL);
        const esp_partition_t *last = esp_ota_get_last_invalid_partition();

        printf("Running partition: %s (0x%lx, %luK)\n",
            running ? running->label : "unknown",
            running ? (unsigned long)running->address : 0,
            running ? (unsigned long)running->size / 1024 : 0);
        printf("Firmware version: %s\n", app_desc ? app_desc->version : "unknown");
        printf("Built: %s %s\n",
            app_desc ? app_desc->date : "unknown",
            app_desc ? app_desc->time : "");
        printf("IDF version: %s\n", app_desc ? app_desc->idf_ver : "unknown");
        printf("Next OTA partition: %s (0x%lx, %luK)\n",
            next ? next->label : "none",
            next ? (unsigned long)next->address : 0,
            next ? (unsigned long)next->size / 1024 : 0);

        if (last) {
            printf("Last invalid partition: %s\n", last->label);
        }

