martin-ger/esp32_PPPoE_router/components/cmd_router/cmd_router.c
    if (strcmp(action, "status") == 0) {
        remote_console_config_t config;
        remote_console_status_t status;
        remote_console_get_config(&config);
        remote_console_get_status(&status);

        printf("Remote Console Status:\n");
        printf("======================\n");
        printf("Enabled:        %s\n", config.enabled ? "yes" : "no");
        printf("Port:           %d\n", config.port);
        printf("Idle timeout:   %lu sec\n", (unsigned long)config.idle_timeout_sec);

        const char *state_str[] = {"disabled", "listening", "auth wait", "active"};
        printf("State:          %s\n", state_str[status.state]);

        if (status.state == RC_STATE_ACTIVE) {
            printf("Client IP:      %s\n", status.client_ip);
            printf("Session time:   %lu sec\n", (unsigned long)status.session_duration_sec);
            printf("Idle:           %lu sec\n", (unsigned long)status.idle_sec);
        }

        printf("Connections:    %lu total\n", (unsigned long)status.total_connections);
        printf("Auth failures:  %lu\n", (unsigned long)status.failed_auths);

        printf("\nWARNING: Currently uses plain TCP (not encrypted).\n");

    } else if (strcmp(action, "enable") == 0) {
        esp_err_t err = remote_console_enable();
        if (err == ESP_OK) {
            ESP_LOGW(TAG, "Remote console enabled via CLI.");
            printf("Remote console enabled.\n");
        } else {
            printf("Error: %s\n", esp_err_to_name(err));
        }

    } else if (strcmp(action, "disable") == 0) {
        remote_console_disable();
        ESP_LOGW(TAG, "Remote console disabled via CLI.");
        printf("Remote console disabled.\n");

    } else if (strcmp(action, "port") == 0) {
        if (argc < 3) {
            printf("Usage: remote_console port <port>\n");
            return 1;
        }
        int port = atoi(argv[2]);
        if (port < 1 || port > 65535) {
            printf("Invalid port number (1-65535)\n");
            return 1;
        }
        remote_console_set_port((uint16_t)port);
        ESP_LOGW(TAG, "Remote console port changed to %d via CLI.", port);
        printf("Port set to %d. Restart or disable/enable to apply.\n", port);

    } else if (strcmp(action, "timeout") == 0) {
        if (argc < 3) {
            printf("Usage: remote_console timeout <seconds>\n");
            return 1;
        }
        uint32_t timeout = (uint32_t)atoi(argv[2]);
        remote_console_set_timeout(timeout);
        ESP_LOGI(TAG, "Remote console timeout changed to %lu sec via CLI.", (unsigned long)timeout);
        printf("Timeout set to %lu seconds.\n", (unsigned long)timeout);

    } else if (strcmp(action, "kick") == 0) {
        esp_err_t err = remote_console_kick();
        if (err == ESP_OK) {
            ESP_LOGW(TAG, "Remote console session kicked via CLI.");
            printf("Kick request sent.\n");
        } else {
            printf("No active session to kick.\n");
        }

    } else {
        printf("Unknown action: %s\n", action);
        return 1;
    }

    return 0;
}

static void register_remote_console_cmd(void)
{
    const esp_console_cmd_t cmd = {
        .command = "remote_console",
        .help = "Manage remote console (network CLI access)\n"
                "  remote_console status              - Show status and connection info\n"
                "  remote_console enable               - Enable remote console\n"
                "  remote_console disable              - Disable remote console\n"
                "  remote_console port <port>          - Set TCP port (default: 2323)\n"
                "  remote_console timeout <seconds>    - Set idle timeout (0=none)\n"
                "  remote_console kick                 - Disconnect current session",
        .hint = " <action> [<args>]",
        .func = &remote_console_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'syslog' command - configure remote syslog forwarding */
static int syslog_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: syslog <action> [args]\n");
        printf("  status                    - Show syslog configuration\n");
        printf("  enable <server> [<port>]  - Enable syslog (default port 514)\n");
        printf("  disable                   - Disable syslog forwarding\n");
        return 0;
    }

    const char *action = argv[1];

    if (strcmp(action, "status") == 0) {
        bool enabled;
        char server[SYSLOG_MAX_SERVER_LEN];
        uint16_t port;
        syslog_get_config(&enabled, server, sizeof(server), &port);

        printf("Syslog Status:\n");
        printf("==============\n");
        printf("Enabled:  %s\n", enabled ? "yes" : "no");
        printf("Server:   %s\n", server[0] ? server : "(not set)");
        printf("Port:     %u\n", port);

    } else if (strcmp(action, "enable") == 0) {
        if (argc < 3) {
            printf("Usage: syslog enable <server> [<port>]\n");
            return 1;
        }
        const char *server = argv[2];
        uint16_t port = SYSLOG_DEFAULT_PORT;
        if (argc >= 4) {
            int p = atoi(argv[3]);
            if (p < 1 || p > 65535) {
                printf("Invalid port number (1-65535)\n");
                return 1;
            }
            port = (uint16_t)p;
        }
        esp_err_t err = syslog_enable(server, port);
        if (err == ESP_OK) {
            ESP_LOGW(TAG, "Syslog enabled: %s:%u via CLI.", server, port);
            printf("Syslog enabled: %s:%u\n", server, port);
        } else {
            printf("Error: %s\n", esp_err_to_name(err));
        }

    } else if (strcmp(action, "disable") == 0) {
        syslog_disable();
        ESP_LOGW(TAG, "Syslog disabled via CLI.");
        printf("Syslog disabled.\n");

    } else {
        printf("Unknown action: %s\n", action);
        return 1;
    }

    return 0;
}

static void register_syslog_cmd(void)
{
    const esp_console_cmd_t cmd = {
        .command = "syslog",
        .help = "Manage remote syslog forwarding\n"
                "  syslog status                    - Show syslog configuration\n"
                "  syslog enable <server> [<port>]  - Enable syslog (default port 514)\n"
                "  syslog disable                   - Disable syslog forwarding",
        .hint = " <action> [<args>]",
        .func = &syslog_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

