martin-ger/esp32_PPPoE_router/components/cmd_router/cmd_router.c
static struct {
    struct arg_str *action;
    struct arg_end *end;
} w5500_arg;

static int w5500_cmd(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **)&w5500_arg);
    if (nerrors != 0) {
        arg_print_errors(stderr, w5500_arg.end, argv[0]);
        return 1;
    }

    const char *action = w5500_arg.action->sval[0];

    if (strcmp(action, "status") == 0) {
        w5500_diag_t d;
        if (w5500_get_diag(&d) != ESP_OK) {
            printf("W5500 not available (MAC not initialised)\n");
            return 1;
        }

        printf("W5500 Diagnostics:\n");
        printf("  Chip version : 0x%02X%s\n", d.version,
               d.version == 0x04 ? " (OK)" : " (!!! unexpected, expect 0x04)");

        bool link  = (d.phycfgr & 0x01) != 0;
        bool spd   = (d.phycfgr & 0x02) != 0;
        bool duplex= (d.phycfgr & 0x04) != 0;
        printf("  PHY          : link=%-4s  speed=%-6s  duplex=%s  PHYCFGR=0x%02X\n",
               link ? "UP" : "DOWN",
               spd  ? "100M" : "10M",
               duplex ? "FULL" : "HALF",
               d.phycfgr);

        bool mode_ok   = (d.sock_mr == 0xA4);
        bool status_ok = (d.sock_sr == 0x42);
        const char *mode_str   = mode_ok   ? "MAC_RAW+FILTER" : "UNEXPECTED";
        const char *status_str = status_ok ? "SOCK_MACRAW"
                           : (d.sock_sr == 0x00) ? "SOCK_CLOSED"
                           : "UNKNOWN";
        printf("  Socket 0     : mode=0x%02X(%s)  status=0x%02X(%s)\n",
               d.sock_mr, mode_str, d.sock_sr, status_str);
        if (!mode_ok) {
            printf("  *** Mode is wrong (expected 0xA4) — W5500 may have reset; run 'w5500 reset'\n");
        } else if (!status_ok) {
            bool link_up = (d.phycfgr & 0x01) != 0;
            if (link_up) {
                printf("  *** Socket CLOSED with link UP — link event may not have fired yet, or run 'w5500 reset'\n");
            } else {
                printf("  Socket CLOSED (link is down — will open when link comes up)\n");
            }
        }

        bool tx_stuck = (d.tx_fsr == 0);
        printf("  TX buffer    : free=%5u/16384  RD=0x%04X  WR=0x%04X%s\n",
               d.tx_fsr, d.tx_rd, d.tx_wr,
               tx_stuck ? "  *** STUCK — free=0" : "");

        printf("  RX buffer    : pending=%5u      RD=0x%04X  WR=0x%04X\n",
               d.rx_rsr, d.rx_rd, d.rx_wr);

        printf("  Interrupts   : SIMR=0x%02X  SOCK0_IR=0x%02X  SOCK0_IMR=0x%02X\n",
               d.simr, d.sock_ir, d.sock_imr);
        if (d.simr != 0x01)   printf("  *** SIMR is 0x%02X, expected 0x01 (SOCK0 only)\n", d.simr);
        if ((d.sock_imr & 0x1F) != 0x14) printf("  *** SOCK0_IMR is 0x%02X, effective 0x%02X, expected 0x14 (RECV+SEND)\n", d.sock_imr, d.sock_imr & 0x1F);
        if (d.sock_ir & 0x10) printf("  *** SEND-done IRQ still pending (SIR_SEND) — TX may have timed out\n");
        if (d.sock_ir & 0x04) printf("  *** RECV IRQ pending (SIR_RECV) — unprocessed RX data\n");

        w5500_spi_stats_t spi = w5500_spi_get_stats();
        printf("  SPI errors   : rd_fail=%"PRIu32"  rd_timeout=%"PRIu32
               "  wr_fail=%"PRIu32"  wr_timeout=%"PRIu32"\n",
               spi.read_spi_fail, spi.read_timeout,
               spi.write_spi_fail, spi.write_timeout);

    } else if (strcmp(action, "reset") == 0) {
        esp_err_t err = w5500_reset_socket();
        if (err == ESP_ERR_INVALID_STATE) {
            printf("W5500 MAC not initialised\n");
            return 1;
        } else if (err != ESP_OK) {
            printf("Socket reset failed: %s\n", esp_err_to_name(err));
            return 1;
        }
        printf("W5500 socket reset complete.\n");

    } else {
        printf("Unknown action '%s'. Use: w5500 status | w5500 reset\n", action);
        return 1;
    }

    return 0;
}

static void register_w5500(void)
{
    w5500_arg.action = arg_str1(NULL, NULL, "<status|reset>",
                                "status: read W5500 registers and show diagnostics\n"
                                "        reset:  soft-reset the socket without disturbing lwIP/NAT state");
    w5500_arg.end = arg_end(1);

    const esp_console_cmd_t cmd = {
        .command = "w5500",
        .help = "W5500 diagnostics and recovery. Usage: w5500 <status|reset>",
        .hint = NULL,
        .func = &w5500_cmd,
        .argtable = &w5500_arg
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
}

#endif // CONFIG_ETH_UPLINK && CONFIG_ETH_DRIVER_W5500